Revit 2026 API

# ConnectionValidationInfo Properties

---

The ConnectionValidationInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

ConnectionValidationInfo Class

Autodesk.Revit.DB Namespace